Revit 2024 API
IDirectContext3DServer.GetApplicationId Method
 Reports this server's application ID.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
string GetApplicationId()
Visual Basic
Function GetApplicationId As String
Visual C++
String^ GetApplicationId()
Return Value
 The application ID.
See Also
IDirectContext3DServer Interface
Autodesk.Revit.DB.DirectContext3D Namespace